Revit 2027 API
DuctSettings.SetPressLossCalculationServerInfo Method
 Set the MEPServerInfo of the current pipe pressure loss calculation server.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetPressLossCalculationServerInfo(
	MEPCalculationServerInfo serverInfo
)
Public Sub SetPressLossCalculationServerInfo (
	serverInfo As MEPCalculationServerInfo
)
public:
void SetPressLossCalculationServerInfo(
	MEPCalculationServerInfo^ serverInfo
)
member SetPressLossCalculationServerInfo :
        serverInfo : MEPCalculationServerInfo -> unit
Parameters
serverInfo MEPCalculationServerInfo
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DuctSettings Class
Autodesk.Revit.DB.Mechanical Namespace